{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "mature-bachelor",
   "metadata": {},
   "source": [
    "# Imports and setup"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 154,
   "id": "sought-space",
   "metadata": {},
   "outputs": [],
   "source": [
    "### imports\n",
    "from transformers import pipeline\n",
    "import wikipediaapi\n",
    "import pandas as pd\n",
    "import sparql\n",
    "import spacy_dbpedia_spotlight\n",
    "import spacy\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "official-texas",
   "metadata": {},
   "outputs": [],
   "source": [
    "### SETUP\n",
    "# the model is pretrained on SQuAD by default, but you can either specify it\n",
    "# model_name = \"deepset/roberta-base-squad2\"\n",
    "qa = pipeline(\"question-answering\")\n",
    "\n",
    "# model for dbpedia-spotlight\n",
    "nlp = spacy.load('en_core_web_lg')\n",
    "# TODO: check if it could be done without all the pipeline\n",
    "nlp.add_pipe('dbpedia_spotlight', config={'language_code':'en', 'overwrite_ents':True})\n",
    "\n",
    "# wikipedia api\n",
    "wiki = wikipediaapi.Wikipedia(\n",
    "        language='en',\n",
    "        extract_format=wikipediaapi.ExtractFormat.WIKI\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "urban-cornwall",
   "metadata": {},
   "source": [
    "# Load data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "paperback-pennsylvania",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>_id</th>\n",
       "      <th>corrected_question</th>\n",
       "      <th>intermediary_question</th>\n",
       "      <th>sparql_query</th>\n",
       "      <th>sparql_template_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1501</td>\n",
       "      <td>How many movies did Stanley Kubrick direct?</td>\n",
       "      <td>How many &lt;movies&gt; are there whose &lt;director&gt; i...</td>\n",
       "      <td>SELECT DISTINCT COUNT(?uri) WHERE {?uri &lt;http:...</td>\n",
       "      <td>101</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2586</td>\n",
       "      <td>Which city's foundeer is John Forbes?</td>\n",
       "      <td>What &lt;city&gt;'s &lt;founded by&gt; is &lt;John Forbes (Br...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE {?uri &lt;http://dbped...</td>\n",
       "      <td>301</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2653</td>\n",
       "      <td>What is the river whose mouth is in deadsea?</td>\n",
       "      <td>What is the &lt;river&gt; whose &lt;river mouth&gt; is &lt;De...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE {?uri &lt;http://dbped...</td>\n",
       "      <td>301</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1055</td>\n",
       "      <td>What is the allegiance of John Kotelawala ?</td>\n",
       "      <td>What is the &lt;allegiance&gt; of John Kotelawala ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>705</td>\n",
       "      <td>How many races have the horses bred by Jacques...</td>\n",
       "      <td>What is the total number of &lt;race&gt; of the &lt;rac...</td>\n",
       "      <td>SELECT DISTINCT COUNT(?uri) WHERE { ?x &lt;http:/...</td>\n",
       "      <td>105</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    _id                                 corrected_question  \\\n",
       "0  1501        How many movies did Stanley Kubrick direct?   \n",
       "1  2586              Which city's foundeer is John Forbes?   \n",
       "2  2653       What is the river whose mouth is in deadsea?   \n",
       "3  1055        What is the allegiance of John Kotelawala ?   \n",
       "4   705  How many races have the horses bred by Jacques...   \n",
       "\n",
       "                               intermediary_question  \\\n",
       "0  How many <movies> are there whose <director> i...   \n",
       "1  What <city>'s <founded by> is <John Forbes (Br...   \n",
       "2  What is the <river> whose <river mouth> is <De...   \n",
       "3      What is the <allegiance> of John Kotelawala ?   \n",
       "4  What is the total number of <race> of the <rac...   \n",
       "\n",
       "                                        sparql_query  sparql_template_id  \n",
       "0  SELECT DISTINCT COUNT(?uri) WHERE {?uri <http:...                 101  \n",
       "1  SELECT DISTINCT ?uri WHERE {?uri <http://dbped...                 301  \n",
       "2  SELECT DISTINCT ?uri WHERE {?uri <http://dbped...                 301  \n",
       "3   SELECT DISTINCT ?uri WHERE { <http://dbpedia....                   2  \n",
       "4  SELECT DISTINCT COUNT(?uri) WHERE { ?x <http:/...                 105  "
      ]
     },
     "execution_count": 97,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# load LC-QALD\n",
    "data = pd.read_json('../data/train-data.json')\n",
    "data.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "exact-raleigh",
   "metadata": {},
   "outputs": [],
   "source": [
    "# filter simple questions and keep only questions and sparql queries\n",
    "questions = data[data.sparql_template_id == 2][['corrected_question', 'sparql_query']]\n",
    "# REMOVE NEXT LINE\n",
    "#questions = questions.head(20)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "varied-field",
   "metadata": {},
   "source": [
    "# Prepare data"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "contrary-disclaimer",
   "metadata": {},
   "source": [
    "## Extract answers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "optional-tokyo",
   "metadata": {},
   "outputs": [],
   "source": [
    "# extract answer from dbpedia endpoint\n",
    "def get_answers(query, endpoint = 'http://dbpedia.org/sparql'):\n",
    "    answers = []\n",
    "    results = sparql.query(endpoint, query)\n",
    "    for row in results:\n",
    "        answers.append(sparql.unpack_row(row)[0])        \n",
    "    return answers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "offshore-cement",
   "metadata": {},
   "outputs": [],
   "source": [
    "questions['answer'] = questions['sparql_query'].apply(get_answers)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "id": "driving-fence",
   "metadata": {},
   "outputs": [],
   "source": [
    "# TODO: be sure to have fixed get_answers to avoid this operation\n",
    "# questions['answers'] = questions['answers'].apply(lambda x: [item for sublist in x for item in sublist])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fewer-means",
   "metadata": {},
   "outputs": [],
   "source": [
    "# questions['answer'] = questions['answer'].apply(lambda x : [' '.join(item.split('/')[-1].split('_')) for item in x])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "id": "economic-grave",
   "metadata": {},
   "outputs": [],
   "source": [
    "# save questions\n",
    "questions.to_csv('../data/questions.csv')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "worst-capacity",
   "metadata": {},
   "source": [
    "## Extract dbpedia entities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 121,
   "id": "eastern-balloon",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Purnima Banerjee'"
      ]
     },
     "execution_count": 121,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_entities(question):\n",
    "    # entity extraction and dbpedia linking\n",
    "    try:\n",
    "        # TODO: fix error\n",
    "        tmp = nlp(question)\n",
    "    except:\n",
    "        ent = 'SpacyError'\n",
    "        return ent\n",
    "\n",
    "    # check results\n",
    "    if len(tmp.ents) == 0:\n",
    "        ent = 'NotFound'\n",
    "    else:\n",
    "        # TODO: i'm not sure on what happens if there are more than one ents :/\n",
    "        # maybe in an english question the subject is always the last entity... \n",
    "        ent = tmp.ents[-1].text # change [0] to [-1]? seems better...\n",
    "    return ent\n",
    "\n",
    "\n",
    "# test\n",
    "get_entities(questions.loc[3966]['corrected_question'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "id": "running-exercise",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>corrected_question</th>\n",
       "      <th>sparql_query</th>\n",
       "      <th>answer</th>\n",
       "      <th>entity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>What is the allegiance of John Kotelawala ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Sri_Lanka]</td>\n",
       "      <td>John Kotelawala</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>What is the region of Tom Perriello ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>Tom Perriello</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Name the mascot of Austin College ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Kangaroo]</td>\n",
       "      <td>Austin College</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Name the origin of Henry Cluney ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Northern_Ireland,...</td>\n",
       "      <td>Henry Cluney</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Name the resting place of Charles Edward Magoon ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Lincoln,_Nebraska...</td>\n",
       "      <td>Charles Edward Magoon</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3966</th>\n",
       "      <td>What is the political party to which Purnima B...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Indian_National_C...</td>\n",
       "      <td>Purnima Banerjee</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3972</th>\n",
       "      <td>What is the currency of Republic of Montenegro...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>Montenegro</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3974</th>\n",
       "      <td>What is the club of Perianne Jones ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[Nakkertok Ski Club]</td>\n",
       "      <td>Perianne Jones</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3994</th>\n",
       "      <td>List all the mmebers of  Mekong River Commission?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Cambodia, http://...</td>\n",
       "      <td>Mekong River Commission</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3999</th>\n",
       "      <td>List the team for which Doug Acomb played ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Toronto_Maple_Leafs]</td>\n",
       "      <td>Doug Acomb</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>597 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     corrected_question  \\\n",
       "3           What is the allegiance of John Kotelawala ?   \n",
       "6                 What is the region of Tom Perriello ?   \n",
       "9                   Name the mascot of Austin College ?   \n",
       "13                    Name the origin of Henry Cluney ?   \n",
       "19    Name the resting place of Charles Edward Magoon ?   \n",
       "...                                                 ...   \n",
       "3966  What is the political party to which Purnima B...   \n",
       "3972  What is the currency of Republic of Montenegro...   \n",
       "3974               What is the club of Perianne Jones ?   \n",
       "3994  List all the mmebers of  Mekong River Commission?   \n",
       "3999        List the team for which Doug Acomb played ?   \n",
       "\n",
       "                                           sparql_query  \\\n",
       "3      SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "6      SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "9      SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "13     SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "19     SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "...                                                 ...   \n",
       "3966   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "3972   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "3974   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "3994   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "3999   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "\n",
       "                                                 answer  \\\n",
       "3               [http://dbpedia.org/resource/Sri_Lanka]   \n",
       "6                                                    []   \n",
       "9                [http://dbpedia.org/resource/Kangaroo]   \n",
       "13    [http://dbpedia.org/resource/Northern_Ireland,...   \n",
       "19    [http://dbpedia.org/resource/Lincoln,_Nebraska...   \n",
       "...                                                 ...   \n",
       "3966  [http://dbpedia.org/resource/Indian_National_C...   \n",
       "3972                                                 []   \n",
       "3974                               [Nakkertok Ski Club]   \n",
       "3994  [http://dbpedia.org/resource/Cambodia, http://...   \n",
       "3999  [http://dbpedia.org/resource/Toronto_Maple_Leafs]   \n",
       "\n",
       "                       entity  \n",
       "3             John Kotelawala  \n",
       "6               Tom Perriello  \n",
       "9              Austin College  \n",
       "13               Henry Cluney  \n",
       "19      Charles Edward Magoon  \n",
       "...                       ...  \n",
       "3966         Purnima Banerjee  \n",
       "3972               Montenegro  \n",
       "3974           Perianne Jones  \n",
       "3994  Mekong River Commission  \n",
       "3999               Doug Acomb  \n",
       "\n",
       "[597 rows x 4 columns]"
      ]
     },
     "execution_count": 122,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# store entities\n",
    "questions['entity'] = questions['corrected_question'].apply(get_entities)\n",
    "questions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "id": "congressional-lambda",
   "metadata": {},
   "outputs": [],
   "source": [
    "# entities = []\n",
    "# for _, row in questions.iterrows():\n",
    "#     # entity extraction and dbpedia linking\n",
    "#     print(row['corrected_question'])\n",
    "#     # TODO: fix the error\n",
    "#     tmp = nlp(row['corrected_question'])\n",
    "#     # check results\n",
    "#     if len(tmp.ents) == 0:\n",
    "#         ent = 'NotFound'\n",
    "#     else:\n",
    "#         # TODO: i'm not sure on what happens if there are more than one ents :/\n",
    "#         ent = tmp.ents[0].text\n",
    "\n",
    "# entities.append(ent)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 123,
   "id": "certain-brooks",
   "metadata": {},
   "outputs": [],
   "source": [
    "# save questions\n",
    "questions.to_csv('../data/questions.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "id": "dynamic-execution",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Invalid records:  30\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>corrected_question</th>\n",
       "      <th>sparql_query</th>\n",
       "      <th>answer</th>\n",
       "      <th>entity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>Where is the swedish covenant hospital?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>143</th>\n",
       "      <td>Which driver came first in the 1993 European G...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Ayrton_Senna]</td>\n",
       "      <td>SpacyError</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>220</th>\n",
       "      <td>Who built the Ford Y-block engine ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Ford_Motor_Company]</td>\n",
       "      <td>SpacyError</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>270</th>\n",
       "      <td>What is Bob Adams (American football) known for?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/National_Football...</td>\n",
       "      <td>SpacyError</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>366</th>\n",
       "      <td>which politician is currently ruling over Rish...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>380</th>\n",
       "      <td>Name the monarch of L Buwei ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>519</th>\n",
       "      <td>Who is the writer of He's a Pirate ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Hans_Zimmer, Klau...</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>596</th>\n",
       "      <td>Who created the world series of Poker?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/United_States, ht...</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>784</th>\n",
       "      <td>which person created the women in the garden?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>790</th>\n",
       "      <td>List the main ingredient of Pizza-ghetti ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>893</th>\n",
       "      <td>Which minister was responsible for Kriminalpol...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>920</th>\n",
       "      <td>What are on the borders of Shimsa Plateau?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1104</th>\n",
       "      <td>What is the affiliation of tani University ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Buddhism]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1224</th>\n",
       "      <td>Name the driver who had a pole finish in 1989 ...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Ayrton_Senna]</td>\n",
       "      <td>SpacyError</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1425</th>\n",
       "      <td>Name the source Island of Bayou ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1896</th>\n",
       "      <td>What are the Languages of Zabbaleen ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Egyptian_Arabic]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1943</th>\n",
       "      <td>Where did ed podolak go to high school</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Atlantic_High_Sch...</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1973</th>\n",
       "      <td>Where did john o conner study?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2187</th>\n",
       "      <td>Who is the Pole driver of 1992 Canadian Grand ...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Ayrton_Senna]</td>\n",
       "      <td>SpacyError</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2236</th>\n",
       "      <td>Who is the builder of Presidio Santa Cruz de T...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Spain]</td>\n",
       "      <td>SpacyError</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2628</th>\n",
       "      <td>List down the important people of The Elders ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Mary_Robinson, Da...</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2802</th>\n",
       "      <td>where are renaissance centers located?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[400, http://dbpedia.org/resource/Detroit, htt...</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2918</th>\n",
       "      <td>From where did Ben Wilson (American football) ...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Carver_High_Schoo...</td>\n",
       "      <td>SpacyError</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2968</th>\n",
       "      <td>Who were the producers of the tenderfoot?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3045</th>\n",
       "      <td>Who was the narrator in the point?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Alan_Thicke, http...</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3086</th>\n",
       "      <td>Name the musical band of Written in the Stars ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3296</th>\n",
       "      <td>What is the area of ITV (Thailand) ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Thailand]</td>\n",
       "      <td>SpacyError</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3437</th>\n",
       "      <td>What is the content license of Darcs ?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/GNU]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3586</th>\n",
       "      <td>Who produced wizards vs aliens?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Brian_Minchin]</td>\n",
       "      <td>NotFound</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3885</th>\n",
       "      <td>Who is the Pole driver of 1997 Canadian Grand ...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia....</td>\n",
       "      <td>[http://dbpedia.org/resource/Michael_Schumacher]</td>\n",
       "      <td>SpacyError</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     corrected_question  \\\n",
       "99              Where is the swedish covenant hospital?   \n",
       "143   Which driver came first in the 1993 European G...   \n",
       "220                 Who built the Ford Y-block engine ?   \n",
       "270    What is Bob Adams (American football) known for?   \n",
       "366   which politician is currently ruling over Rish...   \n",
       "380                       Name the monarch of L Buwei ?   \n",
       "519                Who is the writer of He's a Pirate ?   \n",
       "596              Who created the world series of Poker?   \n",
       "784       which person created the women in the garden?   \n",
       "790          List the main ingredient of Pizza-ghetti ?   \n",
       "893   Which minister was responsible for Kriminalpol...   \n",
       "920          What are on the borders of Shimsa Plateau?   \n",
       "1104       What is the affiliation of tani University ?   \n",
       "1224  Name the driver who had a pole finish in 1989 ...   \n",
       "1425                  Name the source Island of Bayou ?   \n",
       "1896              What are the Languages of Zabbaleen ?   \n",
       "1943             Where did ed podolak go to high school   \n",
       "1973                     Where did john o conner study?   \n",
       "2187  Who is the Pole driver of 1992 Canadian Grand ...   \n",
       "2236  Who is the builder of Presidio Santa Cruz de T...   \n",
       "2628     List down the important people of The Elders ?   \n",
       "2802             where are renaissance centers located?   \n",
       "2918  From where did Ben Wilson (American football) ...   \n",
       "2968          Who were the producers of the tenderfoot?   \n",
       "3045                 Who was the narrator in the point?   \n",
       "3086    Name the musical band of Written in the Stars ?   \n",
       "3296               What is the area of ITV (Thailand) ?   \n",
       "3437             What is the content license of Darcs ?   \n",
       "3586                    Who produced wizards vs aliens?   \n",
       "3885  Who is the Pole driver of 1997 Canadian Grand ...   \n",
       "\n",
       "                                           sparql_query  \\\n",
       "99     SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "143    SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "220    SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "270    SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "366    SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "380    SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "519    SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "596    SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "784    SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "790    SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "893    SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "920    SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "1104   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "1224   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "1425   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "1896   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "1943   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "1973   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "2187   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "2236   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "2628   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "2802   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "2918   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "2968   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "3045   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "3086   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "3296   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "3437   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "3586   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "3885   SELECT DISTINCT ?uri WHERE { <http://dbpedia....   \n",
       "\n",
       "                                                 answer      entity  \n",
       "99                                                   []    NotFound  \n",
       "143          [http://dbpedia.org/resource/Ayrton_Senna]  SpacyError  \n",
       "220    [http://dbpedia.org/resource/Ford_Motor_Company]  SpacyError  \n",
       "270   [http://dbpedia.org/resource/National_Football...  SpacyError  \n",
       "366                                                  []    NotFound  \n",
       "380                                                  []    NotFound  \n",
       "519   [http://dbpedia.org/resource/Hans_Zimmer, Klau...    NotFound  \n",
       "596   [http://dbpedia.org/resource/United_States, ht...    NotFound  \n",
       "784                                                  []    NotFound  \n",
       "790                                                  []    NotFound  \n",
       "893                                                  []    NotFound  \n",
       "920                                                  []    NotFound  \n",
       "1104             [http://dbpedia.org/resource/Buddhism]    NotFound  \n",
       "1224         [http://dbpedia.org/resource/Ayrton_Senna]  SpacyError  \n",
       "1425                                                 []    NotFound  \n",
       "1896      [http://dbpedia.org/resource/Egyptian_Arabic]    NotFound  \n",
       "1943  [http://dbpedia.org/resource/Atlantic_High_Sch...    NotFound  \n",
       "1973                                                 []    NotFound  \n",
       "2187         [http://dbpedia.org/resource/Ayrton_Senna]  SpacyError  \n",
       "2236                [http://dbpedia.org/resource/Spain]  SpacyError  \n",
       "2628  [http://dbpedia.org/resource/Mary_Robinson, Da...    NotFound  \n",
       "2802  [400, http://dbpedia.org/resource/Detroit, htt...    NotFound  \n",
       "2918  [http://dbpedia.org/resource/Carver_High_Schoo...  SpacyError  \n",
       "2968                                                 []    NotFound  \n",
       "3045  [http://dbpedia.org/resource/Alan_Thicke, http...    NotFound  \n",
       "3086                                                 []    NotFound  \n",
       "3296             [http://dbpedia.org/resource/Thailand]  SpacyError  \n",
       "3437                  [http://dbpedia.org/resource/GNU]    NotFound  \n",
       "3586        [http://dbpedia.org/resource/Brian_Minchin]    NotFound  \n",
       "3885   [http://dbpedia.org/resource/Michael_Schumacher]  SpacyError  "
      ]
     },
     "execution_count": 133,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# check inconsistent records\n",
    "inconsistent = questions[(questions['entity'].isin(['NotFound', 'SpacyError'])) | (len(questions['answer']) == 0)]\n",
    "print('Invalid records: ', len(inconsistent))\n",
    "inconsistent"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "canadian-rochester",
   "metadata": {},
   "source": [
    "# QA on wikipedia"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "otherwise-software",
   "metadata": {},
   "outputs": [],
   "source": [
    "# load data to avoid executing the blocks above\n",
    "questions = pd.read_csv('../data/questions.csv', index_col = 0)\n",
    "questions.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 164,
   "id": "casual-ordering",
   "metadata": {},
   "outputs": [],
   "source": [
    "# TODO: fix return values\n",
    "def search_answer(question, entity, debug = False):\n",
    "    # get wikipedia page\n",
    "    p = wiki.page(entity)\n",
    "    \n",
    "    # iterate on sections and find answer in each span\n",
    "    max_score = 0\n",
    "    best_answer = None\n",
    "    for section in p.sections:\n",
    "\n",
    "        # TODO: how to identify a smaller span? (check if it's necessary...)\n",
    "        # if subject in section.text: # look only in relevant sections???\n",
    "        \n",
    "        # exlude last section\n",
    "        if section.title != 'External links':\n",
    "            if debug: print(section.title)\n",
    "            context = section.text\n",
    "            # exlude empty sections (i.e. macro section intestation)\n",
    "            if context != '':\n",
    "                answer = qa(question=question, context=context)\n",
    "                if answer['score'] > max_score:\n",
    "                    max_score = answer['score']\n",
    "                    best_answer = answer\n",
    "                if debug: print(f\"Answer: '{answer['answer']}' with score {answer['score']}\", '\\n', 10*'#')\n",
    "                \n",
    "\n",
    "    # print best answer\n",
    "    if best_answer is not None:  \n",
    "        if debug: print(f\"BEST ANSWER: '{best_answer['answer']}' with score {best_answer['score']}\")\n",
    "    else:\n",
    "        best_answer = 'Sorry, answer not found!'\n",
    "        if debug: print(best_answer)\n",
    "    return best_answer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 165,
   "id": "constitutional-bible",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "# QUESTION:\n",
      " What are the houses of Parliament Security Services ?\n",
      "# SPARQL:\n",
      "  SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Parliament_Security_Services> <http://dbpedia.org/property/houses> ?uri } \n",
      "# POSSIBLE ANSWERS:\n",
      " ['http://dbpedia.org/resource/Rajya_Sabha', 'http://dbpedia.org/resource/Lok_Sabha', '']\n",
      "______________________________\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Sorry, answer not found!'"
      ]
     },
     "execution_count": 165,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# test a question\n",
    "example = questions.iloc[110]\n",
    "\n",
    "print('# QUESTION:\\n', example['corrected_question'])\n",
    "print('# SPARQL:\\n', example['sparql_query'])\n",
    "print('# POSSIBLE ANSWERS:\\n', example['answer'])\n",
    "print('_'*30)\n",
    "\n",
    "search_answer(example['corrected_question'], example['entity'], debug = True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 166,
   "id": "utility-stadium",
   "metadata": {},
   "outputs": [],
   "source": [
    "answers = []\n",
    "for index, row in questions.iterrows():\n",
    "    answers.append(search_answer(row['corrected_question'], row['entity']))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 169,
   "id": "promotional-simulation",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'score': 0.9133368134498596,\n",
       "  'start': 53,\n",
       "  'end': 70,\n",
       "  'answer': 'political leaders'},\n",
       " {'score': 0.9734827876091003,\n",
       "  'start': 71,\n",
       "  'end': 83,\n",
       "  'answer': 'Sierra Leone'},\n",
       " {'score': 0.9678401350975037,\n",
       "  'start': 1438,\n",
       "  'end': 1451,\n",
       "  'answer': 'David Peeples'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.80088871717453, 'start': 36, 'end': 40, 'answer': 'Cuba'},\n",
       " {'score': 0.9982991218566895, 'start': 693, 'end': 701, 'answer': 'He Kexin'},\n",
       " {'score': 0.614020049571991,\n",
       "  'start': 1726,\n",
       "  'end': 1753,\n",
       "  'answer': 'Chief Justice John Marshall'},\n",
       " {'score': 0.5060786604881287,\n",
       "  'start': 14,\n",
       "  'end': 55,\n",
       "  'answer': 'Recipient of the Grand Order of Mugunghwa'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.8656526803970337, 'start': 607, 'end': 614, 'answer': 'Chinese'},\n",
       " {'score': 0.1327703446149826,\n",
       "  'start': 192,\n",
       "  'end': 225,\n",
       "  'answer': 'Everything\\nTelevision Supervision'},\n",
       " {'score': 0.9831961393356323,\n",
       "  'start': 479,\n",
       "  'end': 491,\n",
       "  'answer': 'Selena Gomez'},\n",
       " {'score': 0.529830276966095,\n",
       "  'start': 133,\n",
       "  'end': 158,\n",
       "  'answer': 'Gulf Coast Television Ltd'},\n",
       " {'score': 0.933255672454834, 'start': 335, 'end': 338, 'answer': 'UCR'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.7743380069732666,\n",
       "  'start': 578,\n",
       "  'end': 615,\n",
       "  'answer': 'San Fransokyo Institute of Technology'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.00805633794516325,\n",
       "  'start': 419,\n",
       "  'end': 433,\n",
       "  'answer': 'Gaia Principle'},\n",
       " {'score': 0.31716781854629517,\n",
       "  'start': 83,\n",
       "  'end': 142,\n",
       "  'answer': \"People's Television Network\\nPhilippine Broadcasting Service\"},\n",
       " {'score': 0.509458065032959, 'start': 0, 'end': 6, 'answer': 'Toyota'},\n",
       " {'score': 0.30411216616630554,\n",
       "  'start': 74,\n",
       "  'end': 105,\n",
       "  'answer': 'Secret Path to Oscar Qualifying'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.677361786365509,\n",
       "  'start': 68,\n",
       "  'end': 102,\n",
       "  'answer': 'Robert F. Kennedy Memorial Stadium'},\n",
       " {'score': 0.9300763010978699,\n",
       "  'start': 646,\n",
       "  'end': 669,\n",
       "  'answer': 'Jean-Jacques Dessalines'},\n",
       " {'score': 0.341845840215683, 'start': 0, 'end': 4, 'answer': 'List'},\n",
       " {'score': 0.11970401555299759,\n",
       "  'start': 802,\n",
       "  'end': 810,\n",
       "  'answer': 'Tasmania'},\n",
       " {'score': 0.6108472943305969, 'start': 12, 'end': 20, 'answer': 'Ethiopia'},\n",
       " {'score': 0.8835289478302002,\n",
       "  'start': 90,\n",
       "  'end': 107,\n",
       "  'answer': 'Anna Nicole Smith'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.8531383872032166,\n",
       "  'start': 510,\n",
       "  'end': 524,\n",
       "  'answer': 'command center'},\n",
       " {'score': 0.8259701132774353,\n",
       "  'start': 5,\n",
       "  'end': 19,\n",
       "  'answer': 'External links'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.5410442352294922, 'start': 216, 'end': 220, 'answer': 'East'},\n",
       " {'score': 0.6725258827209473,\n",
       "  'start': 2822,\n",
       "  'end': 2835,\n",
       "  'answer': 'Dwight Howard'},\n",
       " {'score': 0.3441932797431946,\n",
       "  'start': 32,\n",
       "  'end': 69,\n",
       "  'answer': 'United States Numbered Bicycle Routes'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.3857582211494446,\n",
       "  'start': 199,\n",
       "  'end': 234,\n",
       "  'answer': 'Robert E. Wood with Montgomery Ward'},\n",
       " {'score': 0.2768760919570923,\n",
       "  'start': 107,\n",
       "  'end': 137,\n",
       "  'answer': 'Detecting package dependencies'},\n",
       " {'score': 0.9556924104690552, 'start': 0, 'end': 6, 'answer': 'Moscow'},\n",
       " {'score': 0.9863232970237732,\n",
       "  'start': 170,\n",
       "  'end': 183,\n",
       "  'answer': 'Ukrtransstroi'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9058400988578796,\n",
       "  'start': 59,\n",
       "  'end': 82,\n",
       "  'answer': 'Martin Hoberg Hedegaard'},\n",
       " {'score': 0.5344670414924622, 'start': 344, 'end': 352, 'answer': 'the Army'},\n",
       " {'score': 0.3486277759075165,\n",
       "  'start': 298,\n",
       "  'end': 334,\n",
       "  'answer': 'McCarran International Airport (LAS)'},\n",
       " {'score': 0.873084545135498,\n",
       "  'start': 352,\n",
       "  'end': 365,\n",
       "  'answer': 'wine drinkers'},\n",
       " {'score': 0.1978229582309723,\n",
       "  'start': 440,\n",
       "  'end': 452,\n",
       "  'answer': 'eastern half'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.4939979314804077,\n",
       "  'start': 0,\n",
       "  'end': 21,\n",
       "  'answer': '2002 General Election'},\n",
       " {'score': 0.9601272344589233,\n",
       "  'start': 96,\n",
       "  'end': 116,\n",
       "  'answer': 'Callisto Corporation'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.942675769329071, 'start': 100, 'end': 106, 'answer': 'Israel'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.6312282085418701,\n",
       "  'start': 598,\n",
       "  'end': 619,\n",
       "  'answer': 'Harry Potter universe'},\n",
       " {'score': 0.39319923520088196,\n",
       "  'start': 51,\n",
       "  'end': 89,\n",
       "  'answer': 'Sanford N. McDonnell\\nHarry Stonecipher'},\n",
       " {'score': 0.6901467442512512, 'start': 2384, 'end': 2390, 'answer': 'Cicero'},\n",
       " {'score': 0.5025767683982849, 'start': 71, 'end': 78, 'answer': 'Italian'},\n",
       " {'score': 0.9660519957542419, 'start': 146, 'end': 151, 'answer': 'white'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.29739195108413696,\n",
       "  'start': 562,\n",
       "  'end': 575,\n",
       "  'answer': 'Bart and Lisa'},\n",
       " {'score': 0.9541870951652527,\n",
       "  'start': 0,\n",
       "  'end': 19,\n",
       "  'answer': 'Thomas Tudor Tucker'},\n",
       " {'score': 0.24802172183990479,\n",
       "  'start': 0,\n",
       "  'end': 39,\n",
       "  'answer': 'Winterland (disambiguation)\\nWonderworld'},\n",
       " {'score': 0.9402757287025452,\n",
       "  'start': 268,\n",
       "  'end': 279,\n",
       "  'answer': 'Neil Gaiman'},\n",
       " {'score': 0.8971775770187378,\n",
       "  'start': 755,\n",
       "  'end': 806,\n",
       "  'answer': 'English Theater and the Multicultural Mediterranean'},\n",
       " {'score': 0.8815100193023682, 'start': 31, 'end': 39, 'answer': 'sangkats'},\n",
       " {'score': 0.6162480115890503,\n",
       "  'start': 5,\n",
       "  'end': 19,\n",
       "  'answer': 'External links'},\n",
       " {'score': 0.9735592603683472,\n",
       "  'start': 126,\n",
       "  'end': 138,\n",
       "  'answer': 'Medley Relay'},\n",
       " {'score': 0.894519031047821,\n",
       "  'start': 1335,\n",
       "  'end': 1348,\n",
       "  'answer': 'New York Mets'},\n",
       " {'score': 0.9821351170539856,\n",
       "  'start': 579,\n",
       "  'end': 590,\n",
       "  'answer': 'Mario Cuomo'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.25208160281181335,\n",
       "  'start': 491,\n",
       "  'end': 512,\n",
       "  'answer': 'Universal Music Group'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.7336572408676147,\n",
       "  'start': 219,\n",
       "  'end': 229,\n",
       "  'answer': 'pragmatist'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9709593057632446,\n",
       "  'start': 6342,\n",
       "  'end': 6355,\n",
       "  'answer': 'Massachusetts'},\n",
       " {'score': 0.44264712929725647,\n",
       "  'start': 91,\n",
       "  'end': 121,\n",
       "  'answer': 'Pacific, Asia and the Americas'},\n",
       " {'score': 0.26483675837516785,\n",
       "  'start': 103,\n",
       "  'end': 124,\n",
       "  'answer': 'East and West Tilbury'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.551985502243042,\n",
       "  'start': 0,\n",
       "  'end': 30,\n",
       "  'answer': 'Cloud computing security\\nCloud'},\n",
       " {'score': 0.21752694249153137,\n",
       "  'start': 18,\n",
       "  'end': 38,\n",
       "  'answer': \"New York\\nKieft's War\"},\n",
       " {'score': 0.10367412120103836, 'start': 706, 'end': 713, 'answer': 'Buffalo'},\n",
       " {'score': 0.9756729006767273,\n",
       "  'start': 879,\n",
       "  'end': 889,\n",
       "  'answer': 'John Burns'},\n",
       " {'score': 0.529811441898346,\n",
       "  'start': 318,\n",
       "  'end': 347,\n",
       "  'answer': 'racing class\\nFormula Regional'},\n",
       " {'score': 0.36170119047164917,\n",
       "  'start': 215,\n",
       "  'end': 234,\n",
       "  'answer': 'New York politician'},\n",
       " {'score': 0.5057421326637268,\n",
       "  'start': 62,\n",
       "  'end': 79,\n",
       "  'answer': 'Daund–Manmad line'},\n",
       " {'score': 0.988734245300293,\n",
       "  'start': 29,\n",
       "  'end': 45,\n",
       "  'answer': 'Meadowbrook Pond'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.964265763759613, 'start': 548, 'end': 550, 'answer': 'VU'},\n",
       " {'score': 0.07666890323162079, 'start': 821, 'end': 828, 'answer': 'Chinese'},\n",
       " {'score': 0.14194893836975098,\n",
       "  'start': 1350,\n",
       "  'end': 1361,\n",
       "  'answer': 'Boston area'},\n",
       " {'score': 0.9500566124916077,\n",
       "  'start': 279,\n",
       "  'end': 290,\n",
       "  'answer': 'Andrew Weil'},\n",
       " {'score': 0.8931292295455933,\n",
       "  'start': 0,\n",
       "  'end': 40,\n",
       "  'answer': 'Slow Train Coming\\nSaved\\nEmpire Burlesque'},\n",
       " {'score': 0.5909218192100525,\n",
       "  'start': 0,\n",
       "  'end': 29,\n",
       "  'answer': 'Olympiacos\\n Red Star Belgrade'},\n",
       " {'score': 0.8472681045532227,\n",
       "  'start': 39,\n",
       "  'end': 56,\n",
       "  'answer': 'traditional chess'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9971022009849548, 'start': 723, 'end': 731, 'answer': 'Bob Iger'},\n",
       " {'score': 0.8955062627792358,\n",
       "  'start': 13,\n",
       "  'end': 36,\n",
       "  'answer': 'Hermes Airports Limited'},\n",
       " {'score': 0.6275186538696289, 'start': 28, 'end': 34, 'answer': 'racing'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9990248680114746,\n",
       "  'start': 340,\n",
       "  'end': 349,\n",
       "  'answer': 'Bob Dylan'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.6673934459686279,\n",
       "  'start': 407,\n",
       "  'end': 428,\n",
       "  'answer': 'Yale University Press'},\n",
       " {'score': 0.6631585955619812, 'start': 22, 'end': 26, 'answer': 'Bogë'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9462552070617676,\n",
       "  'start': 0,\n",
       "  'end': 12,\n",
       "  'answer': 'Bill Clinton'},\n",
       " {'score': 0.057023320347070694, 'start': 74, 'end': 78, 'answer': '1983'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.08022767305374146,\n",
       "  'start': 0,\n",
       "  'end': 15,\n",
       "  'answer': 'Sex strike\\nList'},\n",
       " {'score': 0.6793863773345947,\n",
       "  'start': 21,\n",
       "  'end': 37,\n",
       "  'answer': 'a work of poetry'},\n",
       " {'score': 0.28622835874557495,\n",
       "  'start': 0,\n",
       "  'end': 40,\n",
       "  'answer': 'Band and Jazz Band\\nChoir\\nOrchestra\\nDrama'},\n",
       " {'score': 0.8852171301841736,\n",
       "  'start': 125,\n",
       "  'end': 134,\n",
       "  'answer': 'shortwave'},\n",
       " {'score': 0.9853492975234985,\n",
       "  'start': 37,\n",
       "  'end': 55,\n",
       "  'answer': 'Kanlapapruek Depot'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.43637052178382874,\n",
       "  'start': 22,\n",
       "  'end': 33,\n",
       "  'answer': 'veal dishes'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9636437296867371,\n",
       "  'start': 1352,\n",
       "  'end': 1384,\n",
       "  'answer': 'Argentina and the Canary Islands'},\n",
       " {'score': 0.8835912346839905,\n",
       "  'start': 190,\n",
       "  'end': 210,\n",
       "  'answer': 'legends and folklore'},\n",
       " {'score': 0.9912551045417786, 'start': 284, 'end': 290, 'answer': 'Tehran'},\n",
       " {'score': 0.991934061050415,\n",
       "  'start': 256,\n",
       "  'end': 266,\n",
       "  'answer': 'Mike White'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.17409279942512512,\n",
       "  'start': 8,\n",
       "  'end': 37,\n",
       "  'answer': 'magister militum per Armeniam'},\n",
       " {'score': 0.14983081817626953,\n",
       "  'start': 314,\n",
       "  'end': 378,\n",
       "  'answer': 'Handles Playboy trademarks on apparel, accessories, collectibles'},\n",
       " {'score': 0.493509978055954, 'start': 22, 'end': 33, 'answer': 'Junior Kiwi'},\n",
       " {'score': 0.03955395147204399,\n",
       "  'start': 268,\n",
       "  'end': 312,\n",
       "  'answer': 'CBS and the Warner Bros. unit of Time Warner'},\n",
       " {'score': 0.9008572697639465,\n",
       "  'start': 300,\n",
       "  'end': 330,\n",
       "  'answer': 'Creative Commons and Hunch.com'},\n",
       " {'score': 0.9721807241439819, 'start': 0, 'end': 9, 'answer': 'John Ryan'},\n",
       " {'score': 0.5988233089447021,\n",
       "  'start': 0,\n",
       "  'end': 20,\n",
       "  'answer': 'Footnotes\\n\\nCitations'},\n",
       " {'score': 0.6158998608589172,\n",
       "  'start': 1271,\n",
       "  'end': 1298,\n",
       "  'answer': 'Crosby, Nichols and Company'},\n",
       " {'score': 0.9817923903465271,\n",
       "  'start': 1264,\n",
       "  'end': 1278,\n",
       "  'answer': 'Happy Holidays'},\n",
       " {'score': 0.8075675964355469,\n",
       "  'start': 5,\n",
       "  'end': 19,\n",
       "  'answer': 'External links'},\n",
       " {'score': 0.9833880662918091, 'start': 180, 'end': 185, 'answer': 'Helen'},\n",
       " {'score': 0.14339818060398102,\n",
       "  'start': 4,\n",
       "  'end': 23,\n",
       "  'answer': 'Seattle Great Wheel'},\n",
       " {'score': 0.6895824074745178, 'start': 9, 'end': 19, 'answer': 'References'},\n",
       " {'score': 0.6273418664932251,\n",
       "  'start': 13,\n",
       "  'end': 24,\n",
       "  'answer': 'Tour Finals'},\n",
       " {'score': 0.6240653991699219,\n",
       "  'start': 37,\n",
       "  'end': 58,\n",
       "  'answer': 'Outline of Madagascar'},\n",
       " {'score': 0.8470871448516846,\n",
       "  'start': 209,\n",
       "  'end': 225,\n",
       "  'answer': 'right-hand drive'},\n",
       " {'score': 0.9171686172485352,\n",
       "  'start': 298,\n",
       "  'end': 314,\n",
       "  'answer': 'Peachtree Street'},\n",
       " {'score': 0.22534914314746857,\n",
       "  'start': 121,\n",
       "  'end': 140,\n",
       "  'answer': 'Lokomotiv Yaroslavl'},\n",
       " {'score': 0.5437237024307251, 'start': 0, 'end': 10, 'answer': 'The M40B16'},\n",
       " {'score': 0.8084275126457214,\n",
       "  'start': 737,\n",
       "  'end': 756,\n",
       "  'answer': 'Governor Strickland'},\n",
       " {'score': 0.8916335105895996,\n",
       "  'start': 1711,\n",
       "  'end': 1718,\n",
       "  'answer': 'Everett'},\n",
       " {'score': 0.9949212670326233, 'start': 156, 'end': 162, 'answer': 'Brunei'},\n",
       " {'score': 0.9023873209953308, 'start': 34, 'end': 44, 'answer': 'Republican'},\n",
       " {'score': 0.7923758625984192,\n",
       "  'start': 325,\n",
       "  'end': 354,\n",
       "  'answer': 'music, dance, arts and sports'},\n",
       " {'score': 0.4406808018684387, 'start': 197, 'end': 202, 'answer': 'Bronx'},\n",
       " {'score': 0.8690752387046814, 'start': 4, 'end': 15, 'answer': 'gas station'},\n",
       " {'score': 0.7005838751792908,\n",
       "  'start': 1067,\n",
       "  'end': 1083,\n",
       "  'answer': 'Columbia Plateau'},\n",
       " {'score': 0.8715493679046631, 'start': 0, 'end': 8, 'answer': 'Burnside'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.8769847750663757,\n",
       "  'start': 291,\n",
       "  'end': 309,\n",
       "  'answer': 'Saints for Dummies'},\n",
       " {'score': 0.9988142848014832, 'start': 8, 'end': 15, 'answer': 'Atlanta'},\n",
       " {'score': 0.20461031794548035,\n",
       "  'start': 19,\n",
       "  'end': 29,\n",
       "  'answer': 'References'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.43784573674201965,\n",
       "  'start': 829,\n",
       "  'end': 843,\n",
       "  'answer': 'border neutral'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.34034353494644165,\n",
       "  'start': 111,\n",
       "  'end': 132,\n",
       "  'answer': 'Gordon\\nJustice Gordon'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9294120669364929,\n",
       "  'start': 57,\n",
       "  'end': 84,\n",
       "  'answer': 'Highbury Preparatory School'},\n",
       " {'score': 0.7289078831672668,\n",
       "  'start': 3308,\n",
       "  'end': 3322,\n",
       "  'answer': 'Carroll Shelby'},\n",
       " {'score': 0.3487497866153717, 'start': 5, 'end': 13, 'answer': 'See also'},\n",
       " {'score': 0.9989215135574341,\n",
       "  'start': 9,\n",
       "  'end': 23,\n",
       "  'answer': 'John McCutchan'},\n",
       " {'score': 0.8526991009712219,\n",
       "  'start': 300,\n",
       "  'end': 317,\n",
       "  'answer': 'Mumbai and Karwar'},\n",
       " {'score': 0.7340043783187866,\n",
       "  'start': 274,\n",
       "  'end': 317,\n",
       "  'answer': 'soccer football, basketball, and volleyball'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.35220810770988464, 'start': 0, 'end': 6, 'answer': 'London'},\n",
       " {'score': 0.7061958909034729, 'start': 60, 'end': 64, 'answer': 'SKAI'},\n",
       " {'score': 0.09290482103824615, 'start': 174, 'end': 181, 'answer': 'Ireland'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.6036765575408936,\n",
       "  'start': 328,\n",
       "  'end': 372,\n",
       "  'answer': 'government-sponsored family planning program'},\n",
       " {'score': 0.9599165320396423, 'start': 18, 'end': 28, 'answer': 'Washington'},\n",
       " {'score': 0.7898134589195251, 'start': 121, 'end': 129, 'answer': 'Thirteen'},\n",
       " {'score': 0.18729767203330994,\n",
       "  'start': 0,\n",
       "  'end': 100,\n",
       "  'answer': 'Rocket and mortar attacks on southern Israel\\nPalestinian casualties of war\\nIsraeli casualties of war'},\n",
       " {'score': 0.6956149935722351,\n",
       "  'start': 985,\n",
       "  'end': 1011,\n",
       "  'answer': 'Roskilde Festival, Denmark'},\n",
       " {'score': 0.9871118664741516, 'start': 60, 'end': 68, 'answer': 'Pakistan'},\n",
       " {'score': 0.2944776117801666,\n",
       "  'start': 17,\n",
       "  'end': 95,\n",
       "  'answer': 'Miss Universe 2008 due to Rodríguez being underage  and finished in the Top 10'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9845499396324158,\n",
       "  'start': 20,\n",
       "  'end': 35,\n",
       "  'answer': 'Thomas S. Hinde'},\n",
       " {'score': 0.34687355160713196,\n",
       "  'start': 33,\n",
       "  'end': 45,\n",
       "  'answer': 'Mary Poppins'},\n",
       " {'score': 0.927560567855835,\n",
       "  'start': 35,\n",
       "  'end': 55,\n",
       "  'answer': 'Yuri Gagarin Academy'},\n",
       " {'score': 0.6086945533752441, 'start': 28, 'end': 32, 'answer': 'Baku'},\n",
       " {'score': 0.9074928760528564, 'start': 160, 'end': 165, 'answer': 'India'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9398050904273987,\n",
       "  'start': 410,\n",
       "  'end': 419,\n",
       "  'answer': 'Ramai Deo'},\n",
       " {'score': 0.8927449584007263, 'start': 464, 'end': 467, 'answer': '575'},\n",
       " {'score': 0.009556714445352554,\n",
       "  'start': 61,\n",
       "  'end': 120,\n",
       "  'answer': 'Phase out all subsidies for fossil fuels and nuclear energy'},\n",
       " {'score': 0.9767930507659912,\n",
       "  'start': 283,\n",
       "  'end': 301,\n",
       "  'answer': 'Sir Ninian Stephen'},\n",
       " {'score': 0.9986048340797424,\n",
       "  'start': 47,\n",
       "  'end': 68,\n",
       "  'answer': 'George Cary Eggleston'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.6782005429267883,\n",
       "  'start': 1146,\n",
       "  'end': 1167,\n",
       "  'answer': 'central North America'},\n",
       " {'score': 0.9820570945739746,\n",
       "  'start': 17,\n",
       "  'end': 30,\n",
       "  'answer': 'Jane Hannaway'},\n",
       " {'score': 0.41380566358566284,\n",
       "  'start': 1056,\n",
       "  'end': 1064,\n",
       "  'answer': 'Budapest'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.7231013178825378, 'start': 92, 'end': 101, 'answer': 'guitarist'},\n",
       " {'score': 0.6951099038124084,\n",
       "  'start': 212,\n",
       "  'end': 236,\n",
       "  'answer': 'Thames Haven and Coryton'},\n",
       " {'score': 0.5962046384811401,\n",
       "  'start': 3155,\n",
       "  'end': 3166,\n",
       "  'answer': 'Victory Day'},\n",
       " {'score': 0.914551854133606,\n",
       "  'start': 233,\n",
       "  'end': 244,\n",
       "  'answer': 'Proof66.com'},\n",
       " {'score': 0.286342591047287,\n",
       "  'start': 51,\n",
       "  'end': 65,\n",
       "  'answer': 'German cuisine'},\n",
       " {'score': 0.9721397161483765, 'start': 554, 'end': 560, 'answer': 'Danish'},\n",
       " {'score': 0.2179800271987915,\n",
       "  'start': 88,\n",
       "  'end': 129,\n",
       "  'answer': 'Rajkiye Buniyadi Ms Panki School\\nSarswati'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.15166419744491577,\n",
       "  'start': 43,\n",
       "  'end': 66,\n",
       "  'answer': 'Melanophobia\\nRich black'},\n",
       " {'score': 0.741238534450531,\n",
       "  'start': 170,\n",
       "  'end': 195,\n",
       "  'answer': 'Gray Marine Motor Company'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.3836037814617157,\n",
       "  'start': 254,\n",
       "  'end': 304,\n",
       "  'answer': 'information, education, culture, and entertainment'},\n",
       " {'score': 0.8348804116249084, 'start': 97, 'end': 105, 'answer': 'Morbihan'},\n",
       " {'score': 0.9874049425125122,\n",
       "  'start': 69,\n",
       "  'end': 84,\n",
       "  'answer': 'David Jefferies'},\n",
       " {'score': 0.9069534540176392,\n",
       "  'start': 4169,\n",
       "  'end': 4178,\n",
       "  'answer': 'Fort Pitt'},\n",
       " {'score': 0.9521963000297546, 'start': 116, 'end': 122, 'answer': 'France'},\n",
       " {'score': 0.9937368631362915, 'start': 164, 'end': 172, 'answer': 'class IV'},\n",
       " {'score': 0.24145224690437317,\n",
       "  'start': 315,\n",
       "  'end': 348,\n",
       "  'answer': 'Looking at the growth of the game'},\n",
       " {'score': 0.06618373095989227,\n",
       "  'start': 45,\n",
       "  'end': 112,\n",
       "  'answer': 'Azerbaijan\\nHeydar Aliyev Palace, a concert hall in Baku, Azerbaijan'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.5966715812683105,\n",
       "  'start': 24,\n",
       "  'end': 47,\n",
       "  'answer': 'Football\\nFootball field'},\n",
       " {'score': 0.4979906678199768,\n",
       "  'start': 0,\n",
       "  'end': 47,\n",
       "  'answer': 'Chief Coastguard\\nMaritime Security Regimes\\nPort'},\n",
       " {'score': 0.5916539430618286,\n",
       "  'start': 87,\n",
       "  'end': 103,\n",
       "  'answer': 'Bogorodsky Uyezd'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9798225164413452, 'start': 19, 'end': 24, 'answer': 'Korea'},\n",
       " {'score': 0.8931147456169128,\n",
       "  'start': 0,\n",
       "  'end': 17,\n",
       "  'answer': 'International Day'},\n",
       " {'score': 0.6787541508674622,\n",
       "  'start': 99,\n",
       "  'end': 115,\n",
       "  'answer': 'Panthera spelaea'},\n",
       " {'score': 0.6480328440666199, 'start': 482, 'end': 486, 'answer': 'Thai'},\n",
       " {'score': 0.4280557334423065,\n",
       "  'start': 0,\n",
       "  'end': 62,\n",
       "  'answer': 'Alliance for Affordable Internet\\nGoogle Free Zone\\nInternet.org'},\n",
       " {'score': 0.3167162537574768,\n",
       "  'start': 87,\n",
       "  'end': 105,\n",
       "  'answer': 'Capitolio Nacional'},\n",
       " {'score': 0.647627592086792,\n",
       "  'start': 0,\n",
       "  'end': 18,\n",
       "  'answer': 'As of 14 June 2019'},\n",
       " {'score': 0.11289212852716446,\n",
       "  'start': 96,\n",
       "  'end': 129,\n",
       "  'answer': 'Roman Catholic Diocese of Balanga'},\n",
       " {'score': 0.7231342792510986,\n",
       "  'start': 160,\n",
       "  'end': 175,\n",
       "  'answer': 'Ludhiana, India'},\n",
       " {'score': 0.8588224053382874,\n",
       "  'start': 4370,\n",
       "  'end': 4385,\n",
       "  'answer': 'Samajwadi Party'},\n",
       " {'score': 0.9968188405036926,\n",
       "  'start': 380,\n",
       "  'end': 396,\n",
       "  'answer': 'Heinrich Himmler'},\n",
       " {'score': 0.08585610240697861,\n",
       "  'start': 0,\n",
       "  'end': 18,\n",
       "  'answer': 'List of Arab towns'},\n",
       " {'score': 0.5626980066299438,\n",
       "  'start': 742,\n",
       "  'end': 763,\n",
       "  'answer': 'glass making industry'},\n",
       " {'score': 0.7809198498725891,\n",
       "  'start': 38,\n",
       "  'end': 66,\n",
       "  'answer': 'Wild Atlantic Way\\nGalway Bay'},\n",
       " {'score': 0.5638313889503479,\n",
       "  'start': 2471,\n",
       "  'end': 2483,\n",
       "  'answer': 'Temple Mount'},\n",
       " {'score': 0.9819600582122803,\n",
       "  'start': 605,\n",
       "  'end': 615,\n",
       "  'answer': 'Sibselmash'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.620745837688446,\n",
       "  'start': 98,\n",
       "  'end': 129,\n",
       "  'answer': 'American Academy of Achievement'},\n",
       " {'score': 0.9574363231658936,\n",
       "  'start': 331,\n",
       "  'end': 345,\n",
       "  'answer': 'Richard Rogers'},\n",
       " {'score': 0.905721127986908, 'start': 154, 'end': 161, 'answer': 'Medford'},\n",
       " {'score': 0.7244011759757996, 'start': 0, 'end': 7, 'answer': 'Berezan'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.37848225235939026,\n",
       "  'start': 103,\n",
       "  'end': 125,\n",
       "  'answer': 'Word 1.0 for Macintosh'},\n",
       " {'score': 0.3117595911026001,\n",
       "  'start': 0,\n",
       "  'end': 44,\n",
       "  'answer': 'European Atlas of the Seas\\nList of languages'},\n",
       " {'score': 0.7912616729736328,\n",
       "  'start': 155,\n",
       "  'end': 168,\n",
       "  'answer': 'Anaheim Ducks'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.12378635257482529,\n",
       "  'start': 207,\n",
       "  'end': 235,\n",
       "  'answer': 'Horserace Betting Levy Board'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9547786712646484,\n",
       "  'start': 78,\n",
       "  'end': 99,\n",
       "  'answer': 'Vanderbilt University'},\n",
       " {'score': 0.9939728379249573,\n",
       "  'start': 97,\n",
       "  'end': 108,\n",
       "  'answer': 'John Howard'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.5314772725105286,\n",
       "  'start': 578,\n",
       "  'end': 604,\n",
       "  'answer': 'The European Go Federation'},\n",
       " {'score': 0.4463198184967041,\n",
       "  'start': 762,\n",
       "  'end': 823,\n",
       "  'answer': 'Associate Justice of the Massachusetts Supreme Judicial Court'},\n",
       " {'score': 0.822155237197876, 'start': 0, 'end': 7, 'answer': 'Outline'},\n",
       " {'score': 0.9734187126159668, 'start': 0, 'end': 4, 'answer': 'Caux'},\n",
       " {'score': 0.1934797167778015,\n",
       "  'start': 58,\n",
       "  'end': 107,\n",
       "  'answer': 'Shin Corporation\\nThai Public Broadcasting Service'},\n",
       " {'score': 0.9661557674407959, 'start': 42, 'end': 48, 'answer': 'Canada'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.3904978036880493, 'start': 232, 'end': 240, 'answer': 'idolatry'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.712395429611206, 'start': 0, 'end': 7, 'answer': 'Outline'},\n",
       " {'score': 0.5895850658416748,\n",
       "  'start': 392,\n",
       "  'end': 406,\n",
       "  'answer': 'pearl industry'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.5057166218757629,\n",
       "  'start': 0,\n",
       "  'end': 18,\n",
       "  'answer': 'Outline of England'},\n",
       " {'score': 0.4001031517982483,\n",
       "  'start': 1082,\n",
       "  'end': 1108,\n",
       "  'answer': 'Allegro Barbaro Re-Release'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9951684474945068,\n",
       "  'start': 169,\n",
       "  'end': 181,\n",
       "  'answer': 'Allan Nevins'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9740498661994934,\n",
       "  'start': 244,\n",
       "  'end': 257,\n",
       "  'answer': 'Mercer Island'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.3420148193836212,\n",
       "  'start': 702,\n",
       "  'end': 723,\n",
       "  'answer': 'Virgin Mary and Child'},\n",
       " {'score': 0.899649977684021, 'start': 70, 'end': 80, 'answer': 'Metropolis'},\n",
       " {'score': 0.4952206015586853,\n",
       "  'start': 14,\n",
       "  'end': 36,\n",
       "  'answer': 'San Francisco Bay Area'},\n",
       " {'score': 0.7789783477783203,\n",
       "  'start': 0,\n",
       "  'end': 14,\n",
       "  'answer': 'Parañaque City'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9483316540718079, 'start': 38, 'end': 46, 'answer': 'Colorado'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9853417873382568,\n",
       "  'start': 381,\n",
       "  'end': 392,\n",
       "  'answer': 'Leo Deutsch'},\n",
       " {'score': 0.6192604303359985,\n",
       "  'start': 0,\n",
       "  'end': 17,\n",
       "  'answer': 'Bili ape\\nHumanzee'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.026190757751464844,\n",
       "  'start': 1521,\n",
       "  'end': 1541,\n",
       "  'answer': 'Berkeley, California'},\n",
       " {'score': 0.4177922308444977,\n",
       "  'start': 111,\n",
       "  'end': 125,\n",
       "  'answer': 'Leicester City'},\n",
       " {'score': 0.22338257730007172, 'start': 61, 'end': 65, 'answer': '2004'},\n",
       " {'score': 0.3666938245296478,\n",
       "  'start': 17,\n",
       "  'end': 41,\n",
       "  'answer': 'Indian National Congress'},\n",
       " {'score': 0.9932328462600708, 'start': 15, 'end': 23, 'answer': 'American'},\n",
       " {'score': 0.8588789701461792,\n",
       "  'start': 211,\n",
       "  'end': 227,\n",
       "  'answer': 'Persian Gulf War'},\n",
       " {'score': 0.855255126953125,\n",
       "  'start': 35,\n",
       "  'end': 54,\n",
       "  'answer': 'Outline of Michigan'},\n",
       " {'score': 0.7110498547554016, 'start': 33, 'end': 43, 'answer': 'SodaStream'},\n",
       " {'score': 0.8162361979484558,\n",
       "  'start': 0,\n",
       "  'end': 13,\n",
       "  'answer': 'Tuolumne Peak'},\n",
       " {'score': 0.32883384823799133,\n",
       "  'start': 34,\n",
       "  'end': 49,\n",
       "  'answer': 'Wayback Machine'},\n",
       " {'score': 0.999214231967926, 'start': 18, 'end': 26, 'answer': 'Nebraska'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.6955567598342896,\n",
       "  'start': 103,\n",
       "  'end': 115,\n",
       "  'answer': 'Pennsylvania'},\n",
       " {'score': 0.8805733323097229,\n",
       "  'start': 1894,\n",
       "  'end': 1911,\n",
       "  'answer': 'Michael Bloomberg'},\n",
       " {'score': 0.8264217376708984,\n",
       "  'start': 240,\n",
       "  'end': 253,\n",
       "  'answer': '1976 and 1977'},\n",
       " {'score': 0.9138578176498413,\n",
       "  'start': 1692,\n",
       "  'end': 1701,\n",
       "  'answer': 'Pam Brady'},\n",
       " {'score': 0.10267645120620728,\n",
       "  'start': 1140,\n",
       "  'end': 1150,\n",
       "  'answer': 'Yuki Nakai'},\n",
       " {'score': 0.6767648458480835,\n",
       "  'start': 20,\n",
       "  'end': 33,\n",
       "  'answer': 'New Testament'},\n",
       " {'score': 0.7289456129074097,\n",
       "  'start': 75,\n",
       "  'end': 91,\n",
       "  'answer': 'Upstate New York'},\n",
       " {'score': 0.9769517183303833,\n",
       "  'start': 358,\n",
       "  'end': 369,\n",
       "  'answer': 'Roger Bacon'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.7806292772293091,\n",
       "  'start': 393,\n",
       "  'end': 427,\n",
       "  'answer': 'Chief Justice of the United States'},\n",
       " {'score': 0.9952875971794128,\n",
       "  'start': 781,\n",
       "  'end': 796,\n",
       "  'answer': 'Brandon Frazier'},\n",
       " {'score': 0.49160274863243103,\n",
       "  'start': 1035,\n",
       "  'end': 1077,\n",
       "  'answer': 'president of the Staten Island Railway Co.'},\n",
       " {'score': 0.9238070845603943, 'start': 63, 'end': 71, 'answer': 'Honolulu'},\n",
       " {'score': 0.4608718156814575,\n",
       "  'start': 85,\n",
       "  'end': 122,\n",
       "  'answer': \"sacred texts of the world's religions\"},\n",
       " {'score': 0.15878325700759888,\n",
       "  'start': 362,\n",
       "  'end': 400,\n",
       "  'answer': 'resigned his commission on 1 July 1931'},\n",
       " {'score': 0.9126332402229309,\n",
       "  'start': 263,\n",
       "  'end': 281,\n",
       "  'answer': 'Major League Rugby'},\n",
       " {'score': 0.8949130773544312, 'start': 18, 'end': 26, 'answer': 'Syracuse'},\n",
       " {'score': 0.9807555079460144, 'start': 24, 'end': 33, 'answer': 'St. Louis'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.717311680316925,\n",
       "  'start': 0,\n",
       "  'end': 16,\n",
       "  'answer': 'Cinema of Sweden'},\n",
       " {'score': 0.714201033115387,\n",
       "  'start': 63,\n",
       "  'end': 75,\n",
       "  'answer': 'Pennsylvania'},\n",
       " {'score': 0.6549074053764343,\n",
       "  'start': 130,\n",
       "  'end': 140,\n",
       "  'answer': 'Radio Logs'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9915501475334167, 'start': 63, 'end': 73, 'answer': 'Greenpeace'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.33223000168800354,\n",
       "  'start': 24,\n",
       "  'end': 47,\n",
       "  'answer': 'Football\\nFootball field'},\n",
       " {'score': 0.7387192845344543, 'start': 143, 'end': 149, 'answer': 'Shasta'},\n",
       " {'score': 0.5788911581039429, 'start': 24, 'end': 29, 'answer': 'Dylan'},\n",
       " {'score': 0.6174647808074951,\n",
       "  'start': 346,\n",
       "  'end': 377,\n",
       "  'answer': 'the Chinese Minority, and China'},\n",
       " {'score': 0.4812842905521393,\n",
       "  'start': 1313,\n",
       "  'end': 1335,\n",
       "  'answer': 'Liverpool City Council'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.757579505443573,\n",
       "  'start': 0,\n",
       "  'end': 36,\n",
       "  'answer': 'The World Register of Marine Species'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.4605877697467804,\n",
       "  'start': 0,\n",
       "  'end': 28,\n",
       "  'answer': 'Forth to Firth Canal Pathway'},\n",
       " {'score': 0.8788977265357971,\n",
       "  'start': 0,\n",
       "  'end': 16,\n",
       "  'answer': 'Marika Gombitová'},\n",
       " {'score': 4.5283672989171464e-07, 'start': 86, 'end': 90, 'answer': '2015'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.47491705417633057,\n",
       "  'start': 221,\n",
       "  'end': 275,\n",
       "  'answer': 'Politicians from across the spectrum of Indian parties'},\n",
       " {'score': 0.9455826282501221,\n",
       "  'start': 154,\n",
       "  'end': 168,\n",
       "  'answer': 'Max Bialystock'},\n",
       " {'score': 0.25152987241744995,\n",
       "  'start': 0,\n",
       "  'end': 33,\n",
       "  'answer': 'Cascade Range\\nChiwaukum Mountains'},\n",
       " {'score': 0.7523787617683411,\n",
       "  'start': 81,\n",
       "  'end': 106,\n",
       "  'answer': 'Charles Ellsworth Goodell'},\n",
       " {'score': 0.687219500541687,\n",
       "  'start': 10,\n",
       "  'end': 35,\n",
       "  'answer': 'White Station High School'},\n",
       " {'score': 0.4478267729282379,\n",
       "  'start': 0,\n",
       "  'end': 50,\n",
       "  'answer': 'Damascus Document\\nList of World Heritage in Danger'},\n",
       " {'score': 0.919374406337738,\n",
       "  'start': 0,\n",
       "  'end': 22,\n",
       "  'answer': 'Literature and Ecology'},\n",
       " {'score': 0.6971186399459839,\n",
       "  'start': 535,\n",
       "  'end': 548,\n",
       "  'answer': 'Hockey Canada'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.7855938673019409, 'start': 1412, 'end': 1417, 'answer': 'Allie'},\n",
       " {'score': 0.9152074456214905,\n",
       "  'start': 504,\n",
       "  'end': 529,\n",
       "  'answer': 'Macosa and General Motors'},\n",
       " {'score': 0.9063720107078552, 'start': 206, 'end': 211, 'answer': 'women'},\n",
       " {'score': 0.9283623695373535,\n",
       "  'start': 76,\n",
       "  'end': 109,\n",
       "  'answer': 'Seattle-Yakima-Moses Lake-Spokane'},\n",
       " {'score': 0.5585362911224365,\n",
       "  'start': 256,\n",
       "  'end': 269,\n",
       "  'answer': 'New York Alki'},\n",
       " {'score': 0.6856468319892883,\n",
       "  'start': 821,\n",
       "  'end': 835,\n",
       "  'answer': 'Victoria Falls'},\n",
       " {'score': 0.8138757944107056,\n",
       "  'start': 9,\n",
       "  'end': 33,\n",
       "  'answer': 'U.S. News & World Report'},\n",
       " {'score': 0.5945677161216736, 'start': 62, 'end': 69, 'answer': 'Alabama'},\n",
       " {'score': 0.7141615748405457,\n",
       "  'start': 354,\n",
       "  'end': 366,\n",
       "  'answer': 'Jackson Hole'},\n",
       " {'score': 0.34000226855278015,\n",
       "  'start': 101,\n",
       "  'end': 111,\n",
       "  'answer': 'Enterprise'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.6548501253128052,\n",
       "  'start': 18,\n",
       "  'end': 35,\n",
       "  'answer': 'Dr. Josef Mengele'},\n",
       " {'score': 0.8093253970146179, 'start': 0, 'end': 4, 'answer': 'OECD'},\n",
       " {'score': 0.827690839767456,\n",
       "  'start': 53,\n",
       "  'end': 75,\n",
       "  'answer': 'North Caucasus Railway'},\n",
       " {'score': 0.7134590148925781,\n",
       "  'start': 140,\n",
       "  'end': 156,\n",
       "  'answer': 'General Managers'},\n",
       " {'score': 0.9906339645385742,\n",
       "  'start': 137,\n",
       "  'end': 150,\n",
       "  'answer': 'Bill Mitchell'},\n",
       " {'score': 0.833971381187439,\n",
       "  'start': 524,\n",
       "  'end': 537,\n",
       "  'answer': 'Lajos Kossuth'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.11069504171609879,\n",
       "  'start': 1298,\n",
       "  'end': 1331,\n",
       "  'answer': \"mixed with the show's theme music\"},\n",
       " {'score': 0.4047195315361023, 'start': 37, 'end': 44, 'answer': 'Bengali'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.721113920211792,\n",
       "  'start': 75,\n",
       "  'end': 88,\n",
       "  'answer': 'Zambezi River'},\n",
       " {'score': 0.06229384243488312,\n",
       "  'start': 711,\n",
       "  'end': 719,\n",
       "  'answer': 'Helsinki'},\n",
       " {'score': 0.29030725359916687, 'start': 28, 'end': 34, 'answer': 'French'},\n",
       " {'score': 0.2260075956583023,\n",
       "  'start': 62,\n",
       "  'end': 89,\n",
       "  'answer': 'Yıldız Technical University'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.3826320767402649, 'start': 23, 'end': 27, 'answer': '2002'},\n",
       " {'score': 0.9869558811187744, 'start': 238, 'end': 243, 'answer': 'EVRAZ'},\n",
       " {'score': 0.5726779699325562,\n",
       "  'start': 1661,\n",
       "  'end': 1681,\n",
       "  'answer': 'The Furchester Hotel'},\n",
       " {'score': 0.20388087630271912,\n",
       "  'start': 415,\n",
       "  'end': 430,\n",
       "  'answer': '\"Promised Land\"'},\n",
       " {'score': 0.9680138826370239,\n",
       "  'start': 17,\n",
       "  'end': 36,\n",
       "  'answer': 'National Geographic'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9949449896812439, 'start': 0, 'end': 6, 'answer': 'Adidas'},\n",
       " {'score': 0.6173311471939087,\n",
       "  'start': 371,\n",
       "  'end': 398,\n",
       "  'answer': 'Rocky Mountains of Colorado'},\n",
       " {'score': 0.9058725237846375, 'start': 73, 'end': 79, 'answer': 'NASCAR'},\n",
       " {'score': 0.9790892601013184,\n",
       "  'start': 3225,\n",
       "  'end': 3236,\n",
       "  'answer': 'Anawan Road'},\n",
       " {'score': 0.9939690828323364, 'start': 35, 'end': 43, 'answer': 'Nigerian'},\n",
       " {'score': 0.44086533784866333,\n",
       "  'start': 460,\n",
       "  'end': 468,\n",
       "  'answer': 'comedian'},\n",
       " {'score': 0.6875380873680115,\n",
       "  'start': 88,\n",
       "  'end': 113,\n",
       "  'answer': 'Al Hirt and Pete Fountain'},\n",
       " {'score': 0.9587812423706055,\n",
       "  'start': 1902,\n",
       "  'end': 1910,\n",
       "  'answer': 'Doniphan'},\n",
       " {'score': 0.16519419848918915,\n",
       "  'start': 36,\n",
       "  'end': 53,\n",
       "  'answer': 'orbital launchers'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.04158316180109978,\n",
       "  'start': 141,\n",
       "  'end': 201,\n",
       "  'answer': 'Kovacs was found guilty and later fined for reckless driving'},\n",
       " {'score': 0.4700030982494354,\n",
       "  'start': 144,\n",
       "  'end': 168,\n",
       "  'answer': 'federal judicial circuit'},\n",
       " {'score': 0.9324557185173035, 'start': 0, 'end': 5, 'answer': 'Tange'},\n",
       " {'score': 0.9682670831680298, 'start': 105, 'end': 111, 'answer': 'Hawaii'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.18021032214164734, 'start': 29, 'end': 33, 'answer': '1947'},\n",
       " {'score': 0.5639640092849731,\n",
       "  'start': 87,\n",
       "  'end': 99,\n",
       "  'answer': 'Dinaric Alps'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.5970162153244019,\n",
       "  'start': 1724,\n",
       "  'end': 1735,\n",
       "  'answer': 'Nobel Prize'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9903286695480347,\n",
       "  'start': 3383,\n",
       "  'end': 3390,\n",
       "  'answer': 'Qusquam'},\n",
       " {'score': 0.7934473752975464,\n",
       "  'start': 99,\n",
       "  'end': 123,\n",
       "  'answer': 'Canadian Labour Congress'},\n",
       " {'score': 0.969528079032898,\n",
       "  'start': 1527,\n",
       "  'end': 1535,\n",
       "  'answer': 'GM India'},\n",
       " {'score': 0.9831922054290771,\n",
       "  'start': 66,\n",
       "  'end': 78,\n",
       "  'answer': 'Random House'},\n",
       " {'score': 0.9533537030220032,\n",
       "  'start': 358,\n",
       "  'end': 368,\n",
       "  'answer': 'Chip Foose'},\n",
       " {'score': 0.8248375654220581,\n",
       "  'start': 116,\n",
       "  'end': 130,\n",
       "  'answer': 'Patrick Tambay'},\n",
       " {'score': 0.9561334848403931,\n",
       "  'start': 0,\n",
       "  'end': 15,\n",
       "  'answer': 'Gabrielle Union'},\n",
       " {'score': 0.2920142412185669,\n",
       "  'start': 57,\n",
       "  'end': 68,\n",
       "  'answer': 'Connecticut'},\n",
       " {'score': 0.4462684094905853,\n",
       "  'start': 100,\n",
       "  'end': 124,\n",
       "  'answer': 'Competitive Cheerleading'},\n",
       " {'score': 0.9681431651115417,\n",
       "  'start': 100,\n",
       "  'end': 116,\n",
       "  'answer': 'listening device'},\n",
       " {'score': 0.8011760115623474,\n",
       "  'start': 144,\n",
       "  'end': 171,\n",
       "  'answer': 'political rallies and fairs'},\n",
       " {'score': 0.9585197567939758,\n",
       "  'start': 36,\n",
       "  'end': 52,\n",
       "  'answer': 'House and Senate'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.767568051815033,\n",
       "  'start': 37,\n",
       "  'end': 51,\n",
       "  'answer': 'American Samoa'},\n",
       " {'score': 0.45457491278648376,\n",
       "  'start': 2754,\n",
       "  'end': 2771,\n",
       "  'answer': 'political enemies'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.3821515738964081,\n",
       "  'start': 37,\n",
       "  'end': 53,\n",
       "  'answer': 'Yeovil Town F.C.'},\n",
       " {'score': 0.9965099096298218, 'start': 20, 'end': 30, 'answer': 'Jay Gorney'},\n",
       " {'score': 0.8023257255554199,\n",
       "  'start': 1279,\n",
       "  'end': 1287,\n",
       "  'answer': 'Cox Farm'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.641626238822937, 'start': 0, 'end': 6, 'answer': 'Museum'},\n",
       " {'score': 0.731683075428009,\n",
       "  'start': 75,\n",
       "  'end': 99,\n",
       "  'answer': 'Virginia\\nHampton Pirates'},\n",
       " {'score': 0.4901830852031708,\n",
       "  'start': 0,\n",
       "  'end': 12,\n",
       "  'answer': 'ny (digraph)'},\n",
       " {'score': 0.41340628266334534,\n",
       "  'start': 3909,\n",
       "  'end': 3917,\n",
       "  'answer': 'Slovakia'},\n",
       " {'score': 0.9220935702323914,\n",
       "  'start': 65,\n",
       "  'end': 77,\n",
       "  'answer': 'chess player'},\n",
       " {'score': 0.09796715527772903, 'start': 0, 'end': 6, 'answer': 'Ultima'},\n",
       " {'score': 0.6049931645393372, 'start': 866, 'end': 872, 'answer': 'Gloria'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.7608541250228882, 'start': 48, 'end': 58, 'answer': 'Physiology'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.5015912055969238, 'start': 119, 'end': 123, 'answer': '2004'},\n",
       " {'score': 0.9577594995498657,\n",
       "  'start': 66,\n",
       "  'end': 87,\n",
       "  'answer': 'MINExpo International'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.7393178939819336,\n",
       "  'start': 194,\n",
       "  'end': 218,\n",
       "  'answer': \"Sarajevo's Bare Cemetery\"},\n",
       " {'score': 0.8170872330665588,\n",
       "  'start': 50,\n",
       "  'end': 61,\n",
       "  'answer': 'communicant'},\n",
       " {'score': 0.9741026163101196, 'start': 61, 'end': 67, 'answer': 'Boston'},\n",
       " {'score': 0.8089514374732971,\n",
       "  'start': 0,\n",
       "  'end': 32,\n",
       "  'answer': 'Johann Anastasius Freylinghausen'},\n",
       " {'score': 0.8098393678665161, 'start': 0, 'end': 5, 'answer': 'Lions'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.7052887678146362,\n",
       "  'start': 53,\n",
       "  'end': 66,\n",
       "  'answer': 'Dornier Do 31'},\n",
       " {'score': 0.10147322714328766,\n",
       "  'start': 761,\n",
       "  'end': 796,\n",
       "  'answer': 'horse riding, shooting and dancing.'},\n",
       " {'score': 0.5152155756950378,\n",
       "  'start': 216,\n",
       "  'end': 229,\n",
       "  'answer': 'United States'},\n",
       " {'score': 0.4650290310382843,\n",
       "  'start': 1,\n",
       "  'end': 25,\n",
       "  'answer': '2. BC Baco Noir wineries'},\n",
       " {'score': 0.9058042764663696,\n",
       "  'start': 156,\n",
       "  'end': 185,\n",
       "  'answer': 'Calvin Stone and Lewis Terman'},\n",
       " {'score': 0.6363304257392883,\n",
       "  'start': 40,\n",
       "  'end': 61,\n",
       "  'answer': 'Connecticut Statesman'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.11258861422538757, 'start': 828, 'end': 835, 'answer': 'Danelaw'},\n",
       " {'score': 0.9156815409660339,\n",
       "  'start': 126,\n",
       "  'end': 140,\n",
       "  'answer': 'The New Yorker'},\n",
       " {'score': 0.09796715527772903, 'start': 0, 'end': 6, 'answer': 'Ultima'},\n",
       " {'score': 0.9339450597763062, 'start': 21, 'end': 29, 'answer': 'Morinish'},\n",
       " {'score': 0.4155014753341675,\n",
       "  'start': 0,\n",
       "  'end': 14,\n",
       "  'answer': 'Hegde (village'},\n",
       " {'score': 0.8157278895378113,\n",
       "  'start': 338,\n",
       "  'end': 370,\n",
       "  'answer': 'Don Mueang International Airport'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.7222778797149658,\n",
       "  'start': 59,\n",
       "  'end': 71,\n",
       "  'answer': 'Brad Paisley'},\n",
       " {'score': 0.931625247001648, 'start': 3173, 'end': 3177, 'answer': 'Navy'},\n",
       " {'score': 0.18695558607578278, 'start': 84, 'end': 90, 'answer': '96.95%'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.2537599205970764, 'start': 2415, 'end': 2420, 'answer': 'three'},\n",
       " {'score': 0.9541671872138977,\n",
       "  'start': 478,\n",
       "  'end': 502,\n",
       "  'answer': 'Indian National Congress'},\n",
       " {'score': 0.6105539798736572,\n",
       "  'start': 818,\n",
       "  'end': 829,\n",
       "  'answer': 'King Alfred'},\n",
       " {'score': 0.37148749828338623, 'start': 0, 'end': 10, 'answer': 'Ahmet Ataç'},\n",
       " {'score': 0.9439929127693176,\n",
       "  'start': 0,\n",
       "  'end': 15,\n",
       "  'answer': 'Dominic\\nDomenic'},\n",
       " {'score': 0.19869068264961243, 'start': 170, 'end': 175, 'answer': 'Chess'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.8263635039329529,\n",
       "  'start': 263,\n",
       "  'end': 274,\n",
       "  'answer': 'Young Thugz'},\n",
       " {'score': 0.958109438419342, 'start': 21, 'end': 25, 'answer': 'UCLA'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.30305808782577515, 'start': 27, 'end': 33, 'answer': 'editor'},\n",
       " {'score': 0.1141384169459343,\n",
       "  'start': 20,\n",
       "  'end': 63,\n",
       "  'answer': '2014 documentary about politics in Zimbabwe'},\n",
       " {'score': 0.9322380423545837, 'start': 70, 'end': 80, 'answer': 'Metropolis'},\n",
       " {'score': 0.990305483341217, 'start': 19, 'end': 26, 'answer': 'Karachi'},\n",
       " {'score': 0.698517918586731,\n",
       "  'start': 5,\n",
       "  'end': 19,\n",
       "  'answer': 'External links'},\n",
       " {'score': 0.49334418773651123,\n",
       "  'start': 24,\n",
       "  'end': 47,\n",
       "  'answer': 'Football\\nFootball field'},\n",
       " {'score': 0.9580466747283936,\n",
       "  'start': 84,\n",
       "  'end': 99,\n",
       "  'answer': 'The Drama Kings'},\n",
       " {'score': 0.43626290559768677,\n",
       "  'start': 35,\n",
       "  'end': 73,\n",
       "  'answer': 'All-time Vancouver Whitecaps FC roster'},\n",
       " {'score': 0.584484875202179,\n",
       "  'start': 80,\n",
       "  'end': 96,\n",
       "  'answer': 'Marthe Cnockaert'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.5310001373291016,\n",
       "  'start': 205,\n",
       "  'end': 223,\n",
       "  'answer': 'major contributors'},\n",
       " {'score': 0.9653978943824768,\n",
       "  'start': 19,\n",
       "  'end': 34,\n",
       "  'answer': 'Walter Tuckwell'},\n",
       " {'score': 0.9860261082649231,\n",
       "  'start': 1692,\n",
       "  'end': 1701,\n",
       "  'answer': 'Pam Brady'},\n",
       " {'score': 0.8991826176643372, 'start': 0, 'end': 9, 'answer': 'San Diego'},\n",
       " {'score': 0.9031612277030945,\n",
       "  'start': 578,\n",
       "  'end': 591,\n",
       "  'answer': 'Thomas Taylor'},\n",
       " {'score': 0.22658149898052216,\n",
       "  'start': 0,\n",
       "  'end': 40,\n",
       "  'answer': 'He is married to the former Susan Hughes'},\n",
       " {'score': 0.47014352679252625, 'start': 15, 'end': 23, 'answer': 'Congress'},\n",
       " {'score': 0.824488639831543,\n",
       "  'start': 557,\n",
       "  'end': 573,\n",
       "  'answer': 'Phillips Academy'},\n",
       " {'score': 0.3148770034313202,\n",
       "  'start': 27,\n",
       "  'end': 50,\n",
       "  'answer': 'Lee Allen, Putnam, 1961'},\n",
       " {'score': 0.4930194318294525,\n",
       "  'start': 644,\n",
       "  'end': 680,\n",
       "  'answer': 'U.S. Naval Intelligence Reserve Unit'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.5189027190208435,\n",
       "  'start': 79,\n",
       "  'end': 102,\n",
       "  'answer': 'Smithsonian Institution'},\n",
       " {'score': 0.33119210600852966,\n",
       "  'start': 737,\n",
       "  'end': 756,\n",
       "  'answer': 'Governor Strickland'},\n",
       " {'score': 0.354633629322052,\n",
       "  'start': 229,\n",
       "  'end': 255,\n",
       "  'answer': '90th pick of the NBA draft'},\n",
       " {'score': 0.9754975438117981,\n",
       "  'start': 1377,\n",
       "  'end': 1384,\n",
       "  'answer': 'Germany'},\n",
       " {'score': 0.24592402577400208,\n",
       "  'start': 0,\n",
       "  'end': 15,\n",
       "  'answer': 'Hegde (village)'},\n",
       " {'score': 0.4907703399658203,\n",
       "  'start': 113,\n",
       "  'end': 153,\n",
       "  'answer': 'the Köppen Climate Classification system'},\n",
       " {'score': 0.5464295744895935,\n",
       "  'start': 677,\n",
       "  'end': 695,\n",
       "  'answer': 'Williams, Marjorie'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9899275898933411,\n",
       "  'start': 100,\n",
       "  'end': 111,\n",
       "  'answer': 'Pu Luo Jong'},\n",
       " {'score': 0.8744758367538452,\n",
       "  'start': 35,\n",
       "  'end': 54,\n",
       "  'answer': 'Outline of Kentucky'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.8212313055992126,\n",
       "  'start': 156,\n",
       "  'end': 172,\n",
       "  'answer': 'Discworld novels'},\n",
       " {'score': 0.7630035877227783, 'start': 0, 'end': 6, 'answer': 'Moscow'},\n",
       " {'score': 0.9313592314720154,\n",
       "  'start': 9,\n",
       "  'end': 45,\n",
       "  'answer': 'Bangladesh, Bhutan, India, and Nepal'},\n",
       " {'score': 0.995834469795227,\n",
       "  'start': 2559,\n",
       "  'end': 2567,\n",
       "  'answer': 'Leo Kahn'},\n",
       " {'score': 0.7887549996376038,\n",
       "  'start': 0,\n",
       "  'end': 35,\n",
       "  'answer': 'Sherry L. Hoppe and Dennie B. Burke'},\n",
       " {'score': 0.44011619687080383,\n",
       "  'start': 327,\n",
       "  'end': 354,\n",
       "  'answer': 'Garci Rodríguez de Montalvo'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9356694221496582, 'start': 14, 'end': 18, 'answer': '1951'},\n",
       " {'score': 0.7223976254463196,\n",
       "  'start': 120,\n",
       "  'end': 133,\n",
       "  'answer': 'Pat Gallagher'},\n",
       " {'score': 0.6299113631248474,\n",
       "  'start': 78,\n",
       "  'end': 91,\n",
       "  'answer': 'Carroll\\nCarol'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.4408949017524719,\n",
       "  'start': 47,\n",
       "  'end': 70,\n",
       "  'answer': 'male, female and junior'},\n",
       " {'score': 0.8006651997566223,\n",
       "  'start': 1659,\n",
       "  'end': 1676,\n",
       "  'answer': 'Katz Broadcasting'},\n",
       " {'score': 0.1055801585316658,\n",
       "  'start': 25,\n",
       "  'end': 55,\n",
       "  'answer': 'uncredited script doctor, 2013'},\n",
       " {'score': 0.8327627182006836,\n",
       "  'start': 39,\n",
       "  'end': 75,\n",
       "  'answer': 'Social Business - Global Initiatives'},\n",
       " {'score': 0.45100006461143494,\n",
       "  'start': 11032,\n",
       "  'end': 11055,\n",
       "  'answer': 'World Champion Openings'},\n",
       " {'score': 0.5903003215789795,\n",
       "  'start': 66,\n",
       "  'end': 94,\n",
       "  'answer': 'several counties and regions'},\n",
       " {'score': 0.827680230140686,\n",
       "  'start': 254,\n",
       "  'end': 273,\n",
       "  'answer': 'Geneva, Switzerland'},\n",
       " {'score': 0.18410992622375488,\n",
       "  'start': 93,\n",
       "  'end': 103,\n",
       "  'answer': 'Tom Sawyer'},\n",
       " {'score': 0.7548052072525024,\n",
       "  'start': 36,\n",
       "  'end': 50,\n",
       "  'answer': 'Houston Astros'},\n",
       " {'score': 0.8588224053382874,\n",
       "  'start': 4370,\n",
       "  'end': 4385,\n",
       "  'answer': 'Samajwadi Party'},\n",
       " {'score': 0.1243322491645813,\n",
       "  'start': 549,\n",
       "  'end': 565,\n",
       "  'answer': 'three colleagues'},\n",
       " {'score': 0.9053708910942078,\n",
       "  'start': 782,\n",
       "  'end': 800,\n",
       "  'answer': 'India and Pakistan'},\n",
       " 'Sorry, answer not found!',\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9968640208244324, 'start': 0, 'end': 3, 'answer': 'Rav'},\n",
       " {'score': 0.9111245274543762,\n",
       "  'start': 1178,\n",
       "  'end': 1196,\n",
       "  'answer': 'Central Park South'},\n",
       " {'score': 0.9793833494186401, 'start': 313, 'end': 316, 'answer': 'law'},\n",
       " {'score': 0.4373621642589569,\n",
       "  'start': 59,\n",
       "  'end': 79,\n",
       "  'answer': 'Camino de Costa Rica'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.7678975462913513,\n",
       "  'start': 0,\n",
       "  'end': 16,\n",
       "  'answer': \"Brunckow's Cabin\"},\n",
       " {'score': 0.05398937687277794,\n",
       "  'start': 0,\n",
       "  'end': 14,\n",
       "  'answer': 'Bogobiri house'},\n",
       " {'score': 0.5259599685668945,\n",
       "  'start': 42,\n",
       "  'end': 59,\n",
       "  'answer': 'Timeline of radio'},\n",
       " {'score': 0.23751729726791382, 'start': 26, 'end': 34, 'answer': 'literary'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9987471699714661, 'start': 293, 'end': 301, 'answer': 'Buddhist'},\n",
       " {'score': 0.9969832897186279, 'start': 346, 'end': 351, 'answer': 'Kenya'},\n",
       " {'score': 0.27004387974739075,\n",
       "  'start': 59,\n",
       "  'end': 71,\n",
       "  'answer': 'South Africa'},\n",
       " {'score': 0.9930528998374939,\n",
       "  'start': 0,\n",
       "  'end': 26,\n",
       "  'answer': 'Sister cities\\nPartnerships'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.6132670640945435,\n",
       "  'start': 244,\n",
       "  'end': 258,\n",
       "  'answer': 'London England'},\n",
       " {'score': 0.7742375731468201, 'start': 84, 'end': 93, 'answer': 'Edinburgh'},\n",
       " {'score': 0.5614617466926575,\n",
       "  'start': 154,\n",
       "  'end': 171,\n",
       "  'answer': 'Microsoft Windows'},\n",
       " {'score': 0.8667477965354919,\n",
       "  'start': 10,\n",
       "  'end': 36,\n",
       "  'answer': 'Prince George of Cambridge'},\n",
       " {'score': 0.8055750727653503,\n",
       "  'start': 148,\n",
       "  'end': 175,\n",
       "  'answer': 'Airports Authority of India'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9610171914100647,\n",
       "  'start': 90,\n",
       "  'end': 109,\n",
       "  'answer': 'George Westinghouse'},\n",
       " {'score': 0.053338587284088135,\n",
       "  'start': 227,\n",
       "  'end': 248,\n",
       "  'answer': 'University of Chicago'},\n",
       " {'score': 0.08003631234169006, 'start': 0, 'end': 7, 'answer': 'Versace'},\n",
       " {'score': 0.8065597414970398, 'start': 6, 'end': 17, 'answer': 'Mario media'},\n",
       " {'score': 0.21044571697711945,\n",
       "  'start': 0,\n",
       "  'end': 53,\n",
       "  'answer': 'Printing House Row District — also in Central Chicago'},\n",
       " {'score': 0.5748212337493896,\n",
       "  'start': 545,\n",
       "  'end': 572,\n",
       "  'answer': 'Pre-revolutionary interiors'},\n",
       " {'score': 0.5026353001594543,\n",
       "  'start': 1686,\n",
       "  'end': 1713,\n",
       "  'answer': 'Lawrence Erlbaum Associates'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.6797987818717957,\n",
       "  'start': 2363,\n",
       "  'end': 2370,\n",
       "  'answer': 'Solunar'},\n",
       " {'score': 0.9243431091308594,\n",
       "  'start': 96,\n",
       "  'end': 154,\n",
       "  'answer': 'William Smith (1707–1783) and Elizabeth (née Quincy) Smith'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.43500158190727234,\n",
       "  'start': 2240,\n",
       "  'end': 2303,\n",
       "  'answer': 'African Bach, Softsword, The Classical Connection 2 and Prayers'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.6343684196472168,\n",
       "  'start': 140,\n",
       "  'end': 156,\n",
       "  'answer': 'General Managers'},\n",
       " {'score': 0.7823678255081177,\n",
       "  'start': 80,\n",
       "  'end': 96,\n",
       "  'answer': 'The Suns Gorilla'},\n",
       " {'score': 0.6284792423248291,\n",
       "  'start': 263,\n",
       "  'end': 281,\n",
       "  'answer': 'Major League Rugby'},\n",
       " {'score': 0.6499612927436829,\n",
       "  'start': 0,\n",
       "  'end': 15,\n",
       "  'answer': 'Coleford, I. C.'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.8983991742134094,\n",
       "  'start': 29,\n",
       "  'end': 44,\n",
       "  'answer': 'Katsura Hoshino'},\n",
       " {'score': 0.9524502754211426, 'start': 0, 'end': 6, 'answer': 'La Val'},\n",
       " {'score': 0.12714003026485443,\n",
       "  'start': 62,\n",
       "  'end': 92,\n",
       "  'answer': 'St Lucia Squad - 2014\\nSt Lucia'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.42022329568862915,\n",
       "  'start': 59,\n",
       "  'end': 79,\n",
       "  'answer': 'Camino de Costa Rica'},\n",
       " {'score': 0.9959331750869751,\n",
       "  'start': 23,\n",
       "  'end': 35,\n",
       "  'answer': 'Jägermeister'},\n",
       " {'score': 0.5244054794311523,\n",
       "  'start': 274,\n",
       "  'end': 298,\n",
       "  'answer': 'administrative assistant'},\n",
       " {'score': 0.27528253197669983, 'start': 26, 'end': 32, 'answer': 'eighth'},\n",
       " {'score': 0.8678445219993591,\n",
       "  'start': 420,\n",
       "  'end': 436,\n",
       "  'answer': 'Lewis University'},\n",
       " {'score': 0.59919673204422, 'start': 0, 'end': 7, 'answer': 'Antoine'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.9687831997871399,\n",
       "  'start': 763,\n",
       "  'end': 806,\n",
       "  'answer': 'Batista, Shelton Benjamin, and Josh Mathews'},\n",
       " {'score': 0.20974883437156677,\n",
       "  'start': 275,\n",
       "  'end': 287,\n",
       "  'answer': 'GP de Mexico'},\n",
       " {'score': 0.6862164735794067,\n",
       "  'start': 20,\n",
       "  'end': 53,\n",
       "  'answer': 'An Account of the Polynesian Race'},\n",
       " {'score': 0.4457152485847473, 'start': 22, 'end': 26, 'answer': 'Joey'},\n",
       " {'score': 0.8208103775978088,\n",
       "  'start': 5,\n",
       "  'end': 19,\n",
       "  'answer': 'External links'},\n",
       " {'score': 0.7288751006126404, 'start': 92, 'end': 99, 'answer': 'Seattle'},\n",
       " 'Sorry, answer not found!',\n",
       " {'score': 0.8541057109832764, 'start': 184, 'end': 191, 'answer': 'Namibia'},\n",
       " {'score': 0.8571990132331848, 'start': 99, 'end': 105, 'answer': 'Giants'},\n",
       " {'score': 0.27496039867401123,\n",
       "  'start': 17,\n",
       "  'end': 41,\n",
       "  'answer': 'Indian National Congress'},\n",
       " {'score': 0.721591591835022,\n",
       "  'start': 11,\n",
       "  'end': 28,\n",
       "  'answer': 'real estate taxes'},\n",
       " {'score': 0.28381794691085815,\n",
       "  'start': 33,\n",
       "  'end': 61,\n",
       "  'answer': 'International Ski Federation'},\n",
       " {'score': 0.8693192601203918,\n",
       "  'start': 5,\n",
       "  'end': 17,\n",
       "  'answer': 'Bibliography'},\n",
       " {'score': 0.7962615489959717,\n",
       "  'start': 42,\n",
       "  'end': 61,\n",
       "  'answer': 'Toronto Maple Leafs'}]"
      ]
     },
     "execution_count": 169,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "answers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 184,
   "id": "copyrighted-gardening",
   "metadata": {},
   "outputs": [],
   "source": [
    "answers_text = [item['answer'] if type(item) != str else item for item in answers]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 188,
   "id": "capital-narrative",
   "metadata": {},
   "outputs": [],
   "source": [
    "# store answers\n",
    "questions['wiki_answer'] =  answers_text"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 190,
   "id": "wicked-armor",
   "metadata": {},
   "outputs": [],
   "source": [
    "questions.to_csv('../data/questions_answered.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "vertical-racing",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}